; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain mailrun)
    (:types
        hamlet scroll satchel courier - object
    )
    (:predicates
        (posted-at ?b - courier ?x - hamlet)
        (resting ?i - scroll ?x - hamlet)
        (road ?x - hamlet ?y - hamlet)
        (idle ?a - satchel)
        (held-in ?i - scroll ?a - satchel)
        (stowed-in ?i - scroll ?b - courier)
        (attached ?a - satchel ?b - courier)
    )

    (:functions
        (pouch_limit ?b - courier)
        (current_pouch ?b - courier)
        (mass ?i - scroll)
        (toll)
    )

    (:action ride
        :parameters (?b - courier ?x - hamlet ?y - hamlet)
        :precondition (and (posted-at ?b ?x)
            (road ?x ?y))
        :effect (and (posted-at ?b ?y)
            (not (posted-at ?b ?x))
            (increase (toll) 3)
        )
    )

    (:action grab
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (resting ?i ?x) (posted-at ?b ?x) (idle ?a) (attached ?a ?b)
            (<= (+ (current_pouch ?b) (mass ?i)) (pouch_limit ?b)))
        :effect (and (held-in ?i ?a)
            (not (resting ?i ?x))
            (not (idle ?a))
            (increase (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action place
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (posted-at ?b ?x)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (resting ?i ?x)
            (not (held-in ?i ?a))
            (decrease (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action to-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (not (held-in ?i ?a))
            (stowed-in ?i ?b)
            (increase (toll) 1)
        )
    )

    (:action from-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (stowed-in ?i ?b)
            (attached ?a ?b)
            (idle ?a))
        :effect (and (not (idle ?a))
            (held-in ?i ?a)
            (not (stowed-in ?i ?b))
            (increase (toll) 1)
        )
    )
)

; problem
(define (problem delivery-x-2)
   (:domain mailrun)
   (:objects hamleta hamletb hamletc - hamlet
             scroll6 scroll5 scroll4 scroll3 scroll2 scroll1 - scroll
             courier1 courier2 - courier
             leftstrap1 rightstrap1 leftstrap2 rightstrap2 - satchel)
   (:init (= (mass scroll6) 1)
          (= (mass scroll5) 1)
          (= (mass scroll4) 1)
          (= (mass scroll3) 1)
          (= (mass scroll2) 1)
          (= (mass scroll1) 1)

          (resting scroll6 hamleta)
          (resting scroll5 hamleta)
          (resting scroll4 hamleta)
          (resting scroll3 hamleta)
          (resting scroll2 hamleta)
          (resting scroll1 hamleta)

          (posted-at courier1 hamleta)
          (posted-at courier2 hamleta)
          (idle leftstrap1)
          (idle rightstrap1)
          (idle leftstrap2)
          (idle rightstrap2)
          (attached leftstrap1 courier1)
          (attached rightstrap1 courier1)
          (attached leftstrap2 courier2)
          (attached rightstrap2 courier2)

          (road hamleta hamletb)
          (road hamletb hamleta)
          (road hamleta hamletc)
          (road hamletc hamleta)

          (= (current_pouch courier1) 0)
          (= (pouch_limit courier1) 4)
          (= (current_pouch courier2) 0)
          (= (pouch_limit courier2) 4)
          (= (toll) 0))


   (:goal (and (resting scroll6 hamletb)
               (resting scroll5 hamletb)
               (resting scroll4 hamletb)
               (resting scroll3 hamletb)
               (resting scroll2 hamletc)
               (resting scroll1 hamletc)))

   (:metric minimize (toll))
)

; plan
1. (grab scroll1 hamleta rightstrap1 courier1)
   deleted: (resting scroll1 hamleta) (idle rightstrap1)
   added: (held-in scroll1 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 0 to 2
   goals met: 0 of 6
2. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 2 to 5
   goals met: 0 of 6
3. (grab scroll2 hamleta rightstrap2 courier2)
   deleted: (resting scroll2 hamleta) (idle rightstrap2)
   added: (held-in scroll2 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 5 to 7
   goals met: 0 of 6
4. (place scroll1 hamletc rightstrap1 courier1)
   deleted: (held-in scroll1 rightstrap1)
   added: (idle rightstrap1) (resting scroll1 hamletc)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 7 to 9
   goals met: 1 of 6
5. (ride courier1 hamletc hamleta)
   deleted: (posted-at courier1 hamletc)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 9 to 12
   goals met: 1 of 6
6. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 12 to 15
   goals met: 1 of 6
7. (grab scroll3 hamleta rightstrap1 courier1)
   deleted: (resting scroll3 hamleta) (idle rightstrap1)
   added: (held-in scroll3 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 15 to 17
   goals met: 1 of 6
8. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 17 to 20
   goals met: 1 of 6
9. (place scroll3 hamletb rightstrap1 courier1)
   deleted: (held-in scroll3 rightstrap1)
   added: (idle rightstrap1) (resting scroll3 hamletb)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 20 to 22
   goals met: 2 of 6
10. (place scroll2 hamletc rightstrap2 courier2)
   deleted: (held-in scroll2 rightstrap2)
   added: (idle rightstrap2) (resting scroll2 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 22 to 24
   goals met: 3 of 6
11. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 24 to 27
   goals met: 3 of 6
12. (grab scroll4 hamleta rightstrap1 courier1)
   deleted: (resting scroll4 hamleta) (idle rightstrap1)
   added: (held-in scroll4 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 27 to 29
   goals met: 3 of 6
13. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 29 to 32
   goals met: 3 of 6
14. (place scroll4 hamletb rightstrap1 courier1)
   deleted: (held-in scroll4 rightstrap1)
   added: (idle rightstrap1) (resting scroll4 hamletb)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 32 to 34
   goals met: 4 of 6
15. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 34 to 37
   goals met: 4 of 6
16. (grab scroll5 hamleta rightstrap1 courier1)
   deleted: (resting scroll5 hamleta) (idle rightstrap1)
   added: (held-in scroll5 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 37 to 39
   goals met: 4 of 6
17. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 39 to 42
   goals met: 4 of 6
18. (place scroll5 hamletb rightstrap1 courier1)
   deleted: (held-in scroll5 rightstrap1)
   added: (idle rightstrap1) (resting scroll5 hamletb)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 42 to 44
   goals met: 5 of 6
19. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 44 to 47
   goals met: 5 of 6
20. (grab scroll6 hamleta rightstrap1 courier1)
   deleted: (resting scroll6 hamleta) (idle rightstrap1)
   added: (held-in scroll6 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 47 to 49
   goals met: 5 of 6
21. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 49 to 52
   goals met: 5 of 6
22. (place scroll6 hamletb rightstrap1 courier1)
   deleted: (held-in scroll6 rightstrap1)
   added: (idle rightstrap1) (resting scroll6 hamletb)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 52 to 54
   goals met: 6 of 6
